<a href="https://colab.research.google.com/github/lim-jr/ESAA/blob/main/0919%EC%9B%94%EA%B3%BC%EC%A0%9C_%EB%A8%B8%EC%8B%A0%EB%9F%AC%EB%8B%9D_%EC%99%84%EB%B2%BD%EA%B0%80%EC%9D%B4%EB%93%9C_2%EC%A3%BC%EC%B0%A8.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## 04. 데이터 핸들링 -판다스

### (1) 판다스 시작  
#### 파일을 DataFrame으로 로딩, 기본API

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [ ]:
import os
os.getcwd()

'/content'

In [ ]:
titanic_df = pd.read_csv('/content/drive/MyDrive/Py_Colab/ESAA_YB/titanic_train.csv')
# '파일명.확장자명'

In [ ]:
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

* survived : 생존=1, 죽음=0
* pclass : 승객 등급. 1등급=1, 2등급=2, 3등급=3
* sibsp : 함께 탑승한 형제 또는 배우자 수
* parch : 함께 탑승한 부모 또는 자녀 수
* ticket : 티켓 번호
* cabin : 선실 번호
* embarked : 탑승장소 S=Southhampton, C=Cherbourg, Q=Queenstown

In [ ]:
print('titanic 변수의 type:', type(titanic_df))
print('DataFrame 크기:', titanic_df.shape)

titanic 변수의 type: <class 'pandas.core.frame.DataFrame'>
DataFrame 크기: (891, 12)

In [ ]:
titanic_df.info()
# 총 데이커건수, 데이터타입, Null건수

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [ ]:
titanic_df.describe()
# 오직 숫자형(int, float)칼럼의 분포도만 조사
# count : not null 인 데이터 건수

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [ ]:
titanic_df.describe(include='all')
# 숫자형+범주형 칼럼 모두 조사

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
count,891.000000,891.000000,891.000000,891,891,714.000000,891.000000,891.000000,891,891.000000,204,889
unique,NaN,NaN,NaN,891,2,NaN,NaN,NaN,681,NaN,147,3
top,NaN,NaN,NaN,"Braund, Mr. Owen Harris",male,NaN,NaN,NaN,347082,NaN,B96 B98,S
freq,NaN,NaN,NaN,1,577,NaN,NaN,NaN,7,NaN,4,644
mean,446.000000,0.383838,2.308642,NaN,NaN,29.699118,0.523008,0.381594,NaN,32.204208,NaN,NaN
std,257.353842,0.486592,0.836071,NaN,NaN,14.526497,1.102743,0.806057,NaN,49.693429,NaN,NaN
min,1.000000,0.000000,1.000000,NaN,NaN,0.420000,0.000000,0.000000,NaN,0.000000,NaN,NaN
25%,223.500000,0.000000,2.000000,NaN,NaN,20.125000,0.000000,0.000000,NaN,7.910400,NaN,NaN
50%,446.000000,0.000000,3.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,14.454200,NaN,NaN
75%,668.500000,1.000000,3.000000,NaN,NaN,38.000000,1.000000,0.000000,NaN,31.000000,NaN,NaN
max,891.000000,1.000000,3.000000,NaN,NaN,80.000000,8.000000,6.000000,NaN,512.329200,NaN,NaN

In [ ]:
titanic_pclass = titanic_df['Pclass']
print(titanic_pclass.head(6))
print(type(titanic_pclass))

# 칼럼일부 떼면 Series 형태로 반환

0    3
1    1
2    3
3    1
4    3
5    3
Name: Pclass, dtype: int64
<class 'pandas.core.series.Series'>

In [ ]:
value_counts = titanic_df['Pclass'].value_counts()
print(type(value_counts))
print(value_counts)

# value_counts(): 해당 칼럼값의 유형과 건수를 Series형태로 반환
#               : 많은 건수 순서로 정렬되어 값을 반환

<class 'pandas.core.series.Series'>
3    491
1    216
2    184
Name: Pclass, dtype: int64

### (2) DataFrame, 리스트, 딕셔너리, ndarray 간의 상호변환

#### (a) list, array, dictionary -> DataFrame

In [ ]:
col_name1 = ['col1']
list1 = [1,2,3]
array1 = np.array(list1)
print(array1.shape)

(3,)

In [ ]:
# 1. 리스트를 이용해 DataFrame 생성
df_list1 = pd.DataFrame(list1, columns=col_name1)
print('1차원 리스트->DataFrame: \n', df_list1)

1차원 리스트->DataFrame:
    col1
0     1
1     2
2     3

In [ ]:
# 2. 넘파이 array 를 이용해 DataFrame 생성
df_array1 = pd.DataFrame(array1, columns=col_name1)
print('1차원 ndarray->DataFrame: \n', df_array1)

1차원 ndarray->DataFrame:
    col1
0     1
1     2
2     3

In [ ]:
# 3. 2차원 데이터 기반으로 DataFrame 생성
col_name2 = ['col1', 'col2', 'col3']

list2 = [[1,2,3],
        [11,12,13]]
array2 = np.array(list2)

df_list2 = pd.DataFrame(list2, columns=col_name2)
print('2차원list->DataFrame: \n', df_list2)

df_array2 = pd.DataFrame(array2, columns=col_name2)
print('2차원array->DataFrame: \n', df_array2)

2차원list->DataFrame:
    col1  col2  col3
0     1     2     3
1    11    12    13
2차원array->DataFrame:
    col1  col2  col3
0     1     2     3
1    11    12    13

In [ ]:
# 4. 딕셔너리를 DataFrame으로 변환
dict = { 'col1':[1,11], 'col2':[2,22], 'col3':[3,33] }
df_dict = pd.DataFrame(dict)
print('딕셔너리->DataFrame: \n', df_dict)

## 딕셔너리의 key -> 데이터프레임의 컬럼명
## 딕셔너리의 value -> 데이터프레임의 데이터

딕셔너리->DataFrame:
    col1  col2  col3
0     1     2     3
1    11    22    33

#### (b) DataFrame -> list, array, dictionary

In [ ]:
# 1. DataFrame을 ndarray로 변환
array3 = df_dict.values
print(array3)
print('df_dict.values 타입:', type(array3), '\n', 'df_dict.shape:', array3.shape)
## 위에서 만든 데이터프레임의 데이터값들(.values)만 추출하면 ndarray로 생성됨

[[ 1  2  3]
 [11 22 33]]
df_dict.values 타입: <class 'numpy.ndarray'>
 df_dict.shape: (2, 3)

In [ ]:
# 2. DataFrame을 list로 변환
list3 = df_dict.values.tolist()
print(list3)
## 데이터프레임의 데이터값들(.values)만 추출하고 리스트로 바꾸기(.tolist)

# 3. DataFrame을 dictionary로 변환
dict3 = df_dict.to_dict('list')
print(dict3)
## 데이터프레임에서 to_dict 메서드를 호출하고, 인자로 'list'를 입력하면 딕셔너리 반환

[[1, 2, 3], [11, 22, 33]]
{'col1': [1, 11], 'col2': [2, 22], 'col3': [3, 33]}

### (3) DataFrame의 칼럼 데이터 세트 생성과 수정

In [ ]:
# 새로운 칼럼 추가
titanic_df['Age_0']=0
titanic_df.head(3)

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked  Age_0
3            4         1       1  Futrelle, M...  female  35.0      1      0  113803  53.1000  C123        S      0
4            5         0       3  Allen, Mr. ...    male  35.0      0      0  373450   8.0500   NaN        S      0
5            6         0       3  Moran, Mr. ...    male   NaN      0      0  330877   8.4583   NaN        Q      0

In [ ]:
# 기존 칼럼을 이용해 새로운 칼럼 생성
titanic_df['Age_by_10']=titanic_df['Age']*10
titanic_df['Family_No']=titanic_df['SibSp']+titanic_df["Parch"]+1
# 형제/배우자 + 부모/자식 + 본인
titanic_df.head(3)

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked  Age_0  Age_by_10  Family_No
3            4         1       1  Futrelle, M...  female  35.0      1      0  113803  53.1000  C123        S      0      350.0          2
4            5         0       3  Allen, Mr. ...    male  35.0      0      0  373450   8.0500   NaN        S      0      350.0          1
5            6         0       3  Moran, Mr. ...    male   NaN      0      0  330877   8.4583   NaN        Q      0        NaN          1

In [ ]:
# 기존 칼럼을 새롭게 업데이트
titanic_df['Age_by_10']=titanic_df['Age_by_10']+100
titanic_df.head(3)

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked  Age_0  Age_by_10  Family_No
3            4         1       1  Futrelle, M...  female  35.0      1      0  113803  53.1000  C123        S      0      450.0          2
4            5         0       3  Allen, Mr. ...    male  35.0      0      0  373450   8.0500   NaN        S      0      450.0          1
5            6         0       3  Moran, Mr. ...    male   NaN      0      0  330877   8.4583   NaN        Q      0        NaN          1

### (4) DataFrame 데이터 삭제

In [ ]:
titanic_df_drop = titanic_df.drop('Age_0', axis=1)
titanic_df_drop.head(3)

# DataFrame.drop(labels='칼럼명', axis=1, inplace=F/T) : 칼럼 삭제
# DataFrame.drop(labels='인덱스', axis=0, inplace=F/T) : 로우 삭제
## inplace=F: 자기자신 그대로(default), inplace=T: 자기자신 삭제

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked  Age_by_10  Family_No
3            4         1       1  Futrelle, M...  female  35.0      1      0  113803  53.1000  C123        S      450.0          2
4            5         0       3  Allen, Mr. ...    male  35.0      0      0  373450   8.0500   NaN        S      450.0          1
5            6         0       3  Moran, Mr. ...    male   NaN      0      0  330877   8.4583   NaN        Q        NaN          1

In [ ]:
# 여러 개의 칼럼 삭제
# inplace = True: 자기자신 내에서 삭제

titanic_df = pd.read_csv('/content/drive/MyDrive/Py_Colab/ESAA_YB/titanic_train.csv')
titanic_df['Age_0']=0
titanic_df['Age_by_10']=titanic_df['Age']*10
titanic_df['Family_No']=titanic_df['SibSp']+titanic_df["Parch"]+1
print("새로운 열 생성 \n", titanic_df.head(3))

titanic_df.drop(['Age_0','Age_by_10', 'Family_No'], axis=1, inplace=True) 
print("여러개 칼럼 삭제, inplace=T \n", titanic_df.head(3))

## inplace=True를 설정한 채로 다른변수에 할당하면 None으로 만들어버림.
titanic_df['Age_0']=0
titanic_df['Age_by_10']=titanic_df['Age']*10
titanic_df['Family_No']=titanic_df['SibSp']+titanic_df["Parch"]+1
drop_result = titanic_df.drop(['Age_0', 'Age_by_10', 'Family_No'], axis=1, inplace=True)
print("여러개 칼럼 삭제, inplace=T, 변수에할당 \n",drop_result)

새로운 열 생성
    PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked  Age_0  Age_by_10  Family_No
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S      0      220.0          2
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C      0      380.0          2
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S      0      260.0          1
여러개 칼럼 삭제, inplace=T
    PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S
여러개 칼럼 삭제, inplace=T, 변수에할당
 None

In [ ]:
pd.set_option('display.width', 10000)
# 출력할 전체 내용의 너비를 1000으로
pd.set_option('display.max_colwidth', 15)
# 출력할 열의 너비를 15로
print(titanic_df.head(3))

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S

In [ ]:
titanic_df.drop([0,1,2], axis=0, inplace=True)
print(titanic_df.head(3))
print(titanic_df.tail(3))
# 인덱스도 3,4,5~ 부터

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
3            4         1       1  Futrelle, M...  female  35.0      1      0  113803  53.1000  C123        S
4            5         0       3  Allen, Mr. ...    male  35.0      0      0  373450   8.0500   NaN        S
5            6         0       3  Moran, Mr. ...    male   NaN      0      0  330877   8.4583   NaN        Q
     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch      Ticket   Fare Cabin Embarked
888          889         0       3  Johnston, M...  female   NaN      1      2  W./C. 6607  23.45   NaN        S
889          890         1       1  Behr, Mr. K...    male  26.0      0      0      111369  30.00  C148        C
890          891         0       3  Dooley, Mr....    male  32.0      0      0      370376   7.75   NaN        Q

### (5) index 객체

* 데이터프레임.index : 인덱스 객체를 1차원 어레이로 추출
* 인덱스객체.values : 인덱스를 출력

In [ ]:
# 원본 파일 다시 로딩
titanic_df = pd.read_csv('/content/drive/MyDrive/Py_Colab/ESAA_YB/titanic_train.csv')# 인덱스 객체 추출
index = titanic_df.index
print(index)
# 인덱스 객체를 실제값 array로 변환
# 인덱스 값들을 1차원 어레이에 담기고(->인덱스 객체) .value로 어레이값들 출력
print('Index 객체 array값: \n', index.values)

In [ ]:
print(type(index.values))
print(index.values.shape)
print(index[:5].values)
print(index.values[:5])
print(index[6])

<class 'numpy.ndarray'>
(891,)
[0 1 2 3 4]
[0 1 2 3 4]
6

In [ ]:
index[0]=5
# ERROR : 한번 만들어진 인덱스 객체는 함부로 변경x

TypeError: Index does not support mutable operations

In [ ]:
series_fair = titanic_df['Fare']
print(series_fair.max(), 
      series_fair.sum(), # 이거랑
      sum(series_fair)) # 이거랑 같다.

512.3292 28693.9493 28693.949299999967

* 데이터프레임.reset_index(inplace=T/F)  
: 새롭게 연속된 숫자형 인덱스 할당하고, 기존 인덱스는 index라는 새로운 칼럼명으로 추가  
: DataFrame으로 반환

In [ ]:
titanic_df = pd.read_csv('/content/drive/MyDrive/Py_Colab/ESAA_YB/titanic_train.csv')

titanic_df.drop([0,1,2], axis=0, inplace=True)
print(titanic_df.head(3))
# 로우 삭제하면서 인덱스도 같이삭제되어 3부터 시작

titanic_df_reset = titanic_df.reset_index(inplace=False)
print(titanic_df_reset.head(3))

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
3            4         1       1  Futrelle, M...  female  35.0      1      0  113803  53.1000  C123        S
4            5         0       3  Allen, Mr. ...    male  35.0      0      0  373450   8.0500   NaN        S
5            6         0       3  Moran, Mr. ...    male   NaN      0      0  330877   8.4583   NaN        Q
   index  PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
0      3            4         1       1  Futrelle, M...  female  35.0      1      0  113803  53.1000  C123        S
1      4            5         0       3  Allen, Mr. ...    male  35.0      0      0  373450   8.0500   NaN        S
2      5            6         0       3  Moran, Mr. ...    male   NaN      0      0  330877   8.4583   NaN        Q

In [ ]:
print('###Before reset_index###')
value_counts = titanic_df['Pclass'].value_counts()
print(value_counts)
print('value_counts 객체변수 타입: ', type(value_counts))
# 칼럼하나만 추출/ value_counts()히면 Series형태로 반환

print('###After reset_index###')
new_value_counts = value_counts.reset_index(inplace=False)
print(new_value_counts)
print('new_value_counts 객체변수 타입: ', type(new_value_counts))
# 그러나 reset_index()하면 DataFrame으로 반환

###Before reset_index###
3    489
1    215
2    184
Name: Pclass, dtype: int64
value_counts 객체변수 타입:  <class 'pandas.core.series.Series'>
###After reset_index###
   index  Pclass
0      3     489
1      1     215
2      2     184
new_value_counts 객체변수 타입:  <class 'pandas.core.frame.DataFrame'>

* 새로운 칼럼으로 들어간 기존 인덱스의 칼럼명  
-> 칼럼명 바꾸기  
-> 1부터 시작하는 새로운 인덱스 값 만들기

In [ ]:
data = {'Name':['Chulmin', 'Eunkyung','Jinwoong', 'Soobeom'],
       'Year':[2011,2016,2015,2015],
       'Gender':['M','F','M','M']}
data_df = pd.DataFrame(data, index=['one', 'two', 'three', 'four'])
data_df

           Name  Year Gender
one     Chulmin  2011      M
two    Eunkyung  2016      F
three  Jinwoong  2015      M
four    Soobeom  2015      M

In [ ]:
# data_df를 reset_index()로 새로운 숫자형 인덱스를 생성
data_df_reset = data_df.reset_index()
data_df_reset = data_df_reset.rename(columns={'index':'old_index'})

# 인덱스값에 1을 더해서 1부터 시작하는 새로운 인덱스값 생성
data_df_reset.index = data_df_reset.index +1
data_df_reset

  old_index      Name  Year Gender
1       one   Chulmin  2011      M
2       two  Eunkyung  2016      F
3     three  Jinwoong  2015      M
4      four   Soobeom  2015      M

### (6) 데이터 셀렉션 및 필터링

#### (a) DataFrame의 [ ] 연산자  
DataFrame 바로 뒤에 있는 [ ] 안에 들어갈 수 있는 것은  
칼럼지정연산자 (1. 칼럼명 문자, 2. 인덱스로 변환 가능한 표현식)

In [ ]:
# 칼럼지정 연산자
# 1. 칼럼명 문자

print('단일 칼럼 데이터 추출: \n', titanic_df['Pclass'].head(3))
print('\n 여러 칼럼의 데이터 추출: \n', titanic_df[['Survived', 'Pclass']].head(3))
print('[ ]안에 숫자 인덱스는 오류 발생: \n', titanic_df[0])

In [ ]:
# 칼럼지정 연산자
# 2. 인덱스로 변환 가능한 표현식
titanic_df[0:2]
## 얘는 처음 2개의 observation (즉, 행)을 출력 
## 추천하지 않는다고함..

# 3. 불린 인덱싱 표현
titanic_df[titanic_df['Pclass']==3].head(3)

   PassengerId  Survived  Pclass            Name   Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
4            5         0       3  Allen, Mr. ...  male  35.0      0      0  373450   8.0500   NaN        S
5            6         0       3  Moran, Mr. ...  male   NaN      0      0  330877   8.4583   NaN        Q
7            8         0       3  Palsson, Ma...  male   2.0      3      1  349909  21.0750   NaN        S

#### (b) DataFrame iloc[] 연산자
* 위치기반 인덱싱 : 0을 출발점으로 하는 가로축, 세로축 좌표기반으로 행과 열 위치 지정  
* 행과 열 값으로 integer, integer형의 슬라이싱, 팬시 리스트 값을 입력해야 함

In [ ]:
data = {'Name':['Chulmin', 'Eunkyung','Jinwoong', 'Soobeom'],
       'Year':[2011,2016,2015,2015],
       'Gender':['M','F','M','M']}
data_df = pd.DataFrame(data, index=['one', 'two', 'three', 'four'])
data_df

           Name  Year Gender
one     Chulmin  2011      M
two    Eunkyung  2016      F
three  Jinwoong  2015      M
four    Soobeom  2015      M

In [ ]:
data_df.iloc[0,0]

'Chulmin'

In [ ]:
# 다음 코드는 오류 발생
#data_df.iloc[0,'Name']

In [ ]:
# 다음 코드는 오류 발생
#data_df.iloc['one',0]

In [ ]:
data_df_reset = data_df.reset_index()
data_df_reset = data_df_reset.rename(columns={'index':'old_index'})
data_df_reset.index = data_df_reset.index +1

print(data_df_reset.head(3))
print(data_df_reset.iloc[0,1])

  old_index      Name  Year Gender
1       one   Chulmin  2011      M
2       two  Eunkyung  2016      F
3     three  Jinwoong  2015      M
Chulmin

#### (c) DataFrame loc[] 연산자
* 명칭 기반 인덱싱 : 칼럼의 명칭을 기반으로 위치 지정
* 행의 위치 : 인덱스 값 (데이터에 따라 문자형/숫자형 모두 가능)
* 열의 위치 : 칼럼 명

In [ ]:
# 인덱스가 문자형일 경우
print(data_df.head(3))
print(data_df.loc['one', 'Name'])

# 인덱스가 숫자형일 경우
print(data_df_reset.head(3))
print(data_df_reset.loc[1,'Name'])

           Name  Year Gender
one     Chulmin  2011      M
two    Eunkyung  2016      F
three  Jinwoong  2015      M
Chulmin
  old_index      Name  Year Gender
1       one   Chulmin  2011      M
2       two  Eunkyung  2016      F
3     three  Jinwoong  2015      M
Chulmin

In [ ]:
# 다음 코드는 오류 발생
# data_df_reset.loc[0, 'Name']

#### (d) iloc[], iloc[]에서 슬라이싱 적용
* iloc[a:b, p] : 위치기반 인덱싱으로, a ~ b-1  
* loc[a:b, p] : 명칭기반 인덱싱으로, a~b

In [ ]:
print(data_df.head(3), '\n')

print(data_df.iloc[0:1, 0], '\n')
# 0행-0열 출력
# 슬라이싱의 끝값 포함x

print(data_df.loc['one':'two', 'Name'])
# one행-Name열, two행-Name열 출력
# 슬라이싱의 끝값도 포함o

           Name  Year Gender
one     Chulmin  2011      M
two    Eunkyung  2016      F
three  Jinwoong  2015      M

one    Chulmin
Name: Name, dtype: object

one     Chulmin
two    Eunkyung
Name: Name, dtype: object

In [ ]:
# loc[a:b, p]에서 a~b 출력
# 인덱스가 숫자형이더라도 끝값 포함o
print(data_df_reset.head(3), '\n')
print(data_df_reset.loc[1:2, 'Name'])

  old_index      Name  Year Gender
1       one   Chulmin  2011      M
2       two  Eunkyung  2016      F
3     three  Jinwoong  2015      M

1     Chulmin
2    Eunkyung
Name: Name, dtype: object

#### (e) 불린 인덱싱

In [ ]:
titanic_df = pd.read_csv('/content/drive/MyDrive/Py_Colab/ESAA_YB/titanic_train.csv')

In [ ]:
titanic_boolean = titanic_df[titanic_df['Age']>60]
print(type(titanic_boolean)) 
# 불린 필터링한 데이터의 타입은 데이터프레임
titanic_boolean

<class 'pandas.core.frame.DataFrame'>

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch       Ticket      Fare        Cabin Embarked
33            34         0       2  Wheadon, Mr...    male  66.0      0      0   C.A. 24579   10.5000          NaN        S
54            55         0       1  Ostby, Mr. ...    male  65.0      0      1       113509   61.9792          B30        C
96            97         0       1  Goldschmidt...    male  71.0      0      0     PC 17754   34.6542           A5        C
116          117         0       3  Connors, Mr...    male  70.5      0      0       370369    7.7500          NaN        Q
170          171         0       1  Van der hoe...    male  61.0      0      0       111240   33.5000          B19        S
252          253         0       1  Stead, Mr. ...    male  62.0      0      0       113514   26.5500          C87        S
275          276         1       1  Andrews, Mi...  female  63.0      1      0        13502   77.9583           D7        S
280          281         0       3  Duane, Mr. ...    male  65.0      0      0       336439    7.7500          NaN        Q
326          327         0       3  Nysveen, Mr...    male  61.0      0      0       345364    6.2375          NaN        S
438          439         0       1  Fortune, Mr...    male  64.0      1      4        19950  263.0000  C23 C25 C27        S
456          457         0       1  Millet, Mr....    male  65.0      0      0        13509   26.5500          E38        S
483          484         1       3  Turkula, Mr...  female  63.0      0      0         4134    9.5875          NaN        S
493          494         0       1  Artagaveyti...    male  71.0      0      0     PC 17609   49.5042          NaN        C
545          546         0       1  Nicholson, ...    male  64.0      0      0          693   26.0000          NaN        S
555          556         0       1  Wright, Mr....    male  62.0      0      0       113807   26.5500          NaN        S
570          571         1       2  Harris, Mr....    male  62.0      0      0  S.W./PP 752   10.5000          NaN        S
625          626         0       1  Sutton, Mr....    male  61.0      0      0        36963   32.3208          D50        S
630          631         1       1  Barkworth, ...    male  80.0      0      0        27042   30.0000          A23        S
672          673         0       2  Mitchell, M...    male  70.0      0      0   C.A. 24580   10.5000          NaN        S
745          746         0       1  Crosby, Cap...    male  70.0      1      1    WE/P 5735   71.0000          B22        S
829          830         1       1  Stone, Mrs....  female  62.0      0      0       113572   80.0000          B28      NaN
851          852         0       3  Svensson, M...    male  74.0      0      0       347060    7.7750          NaN        S

In [ ]:
titanic_df[titanic_df['Age']>60][['Name','Age']].head(3)
# Age>60으로 불린 필터링한 데이터 중에서 두 열, 세개 관측치만 추출

              Name   Age
33  Wheadon, Mr...  66.0
54  Ostby, Mr. ...  65.0
96  Goldschmidt...  71.0

In [ ]:
titanic_df[
    (titanic_df['Age']>60) & (titanic_df['Pclass']==1) & (titanic_df['Sex']=='female')
]

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
275          276         1       1  Andrews, Mi...  female  63.0      1      0   13502  77.9583    D7        S
829          830         1       1  Stone, Mrs....  female  62.0      0      0  113572  80.0000   B28      NaN

### (7) 정렬, Aggregation 함수, GroupBy 적용

#### (a) sort_values()  
* DataFrame, Series 정렬  
* DataFrame.sort_values(by=['특정칼럼명'], ascending=T/F, inplace=T/F)

In [3]:
import numpy as np
import pandas as pd
from google.colab import drive
drive.mount('/content/drive')
titanic_df = pd.read_csv('/content/drive/MyDrive/Py_Colab/ESAA_YB/titanic_train.csv')

Mounted at /content/drive

In [6]:
titanic_sorted = titanic_df.sort_values(by=['Name'])
titanic_sorted.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
845,846,0,3,"Abbing, Mr. Anthony",male,42.0,0,0,C.A. 5547,7.55,NaN,S
746,747,0,3,"Abbott, Mr. Rossmore Edward",male,16.0,1,1,C.A. 2673,20.25,NaN,S
279,280,1,3,"Abbott, Mrs. Stanton (Rosa Hunt)",female,35.0,1,1,C.A. 2673,20.25,NaN,S

In [7]:
titanic_sorted2 = titanic_df.sort_values(by=['Pclass', 'Name'], ascending=False)
titanic_sorted2.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5,NaN,S
282,283,0,3,"de Pelsmaeker, Mr. Alfons",male,16.0,0,0,345778,9.5,NaN,S

#### (b) Aggregation 함수 적용
* df.min(), max(), sum(), count() 등등
* df.agg([max, min]) 등등

In [ ]:
titanic_df.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [8]:
# 특정 칼럼에만 함수 적용
titanic_df[['Age', 'Fare']].mean()

Age     29.699118
Fare    32.204208
dtype: float64

In [17]:
# 여러개의 aggregation 함수를 쓰고 싶을 때 
## 1. agg([__, __])
titanic_df[['Age']].agg([max, min])

## 2. agg(딕셔너리)
## 뒤에 그룹바이 내용에서

       Age
max  80.00
min   0.42

#### (c) groupby()
* df.groupby(by='칼럼명')  
  : 지정한 칼럼을 기준으로 그룹화
* DataFrameGroupBy 라는 타입으로 반환

In [14]:
# GroupBy
titanic_groupby0 = titanic_df.groupby(by='Pclass')
print(type(titanic_groupby0))
print(titanic_groupby0) 
# 그룹바이만 하면 출력x

pd.set_option('display.width', 10000)
titanic_groupby1 = titanic_df.groupby(by='Pclass').count()
print(titanic_groupby1)
# 그룹바이 - aggregation함수 적용

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>
<pandas.core.groupby.generic.DataFrameGroupBy object at 0x7f20709f5b50>
        PassengerId  Survived  Name  Sex  Age  SibSp  Parch  Ticket  Fare  Cabin  Embarked
Pclass
1               216       216   216  216  186    216    216     216   216    176       214
2               184       184   184  184  173    184    184     184   184     16       184
3               491       491   491  491  355    491    491     491   491     12       491

In [15]:
titanic_groupby2 = titanic_df.groupby('Pclass')[['PassengerId', 'Survived']].count()
titanic_groupby2

        PassengerId  Survived
Pclass
1               216       216
2               184       184
3               491       491

In [19]:
titanic_groupby3 = titanic_df.groupby('Pclass')['Age'].agg([max, min])
titanic_groupby3

         max   min
Pclass
1       80.0  0.92
2       70.0  0.67
3       74.0  0.42

In [20]:
agg_format = {'Age':'max', 'SibSp':'sum', 'Fare':'mean'} # 딕셔너리 형태로, 'agg이 적용될 칼럼명':'agg함수' 를 입력
titanic_groupby4 = titanic_df.groupby('Pclass').agg(agg_format) # df.agg(딕셔너리)
titanic_groupby4

         Age  SibSp       Fare
Pclass
1       80.0     90  84.154687
2       70.0     74  20.662183
3       74.0    302  13.675550

### (8) 결손 데이터 처리

* 넘파이에서 결손데이터를 NaN으로 표시
* 연산시 제외됨
* 머신러닝 알고리즘은 NaN을 처리하지 않으므로 이 값을 다른 값으로 대체해야 함
* isna() : NaN 여부 확인
* fillna() : 다른 값으로 대체

In [21]:
# 1. isna() : NaN 여부 확인
titanic_df.isna().head(3)

## Cabin열에 NaN이 있다고 True 출력

   PassengerId  Survived  Pclass   Name    Sex    Age  SibSp  Parch  Ticket   Fare  Cabin  Embarked
0        False     False   False  False  False  False  False  False   False  False   True     False
1        False     False   False  False  False  False  False  False   False  False  False     False
2        False     False   False  False  False  False  False  False   False  False   True     False

In [22]:
titanic_df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [24]:
# 2. fillna() : 결손데이터 대체
titanic_df['Cabin'] = titanic_df['Cabin'].fillna('C000')
titanic_df.head(3)

   PassengerId  Survived  Pclass                                               Name     Sex   Age  SibSp  Parch            Ticket     Fare Cabin Embarked
0            1         0       3                            Braund, Mr. Owen Harris    male  22.0      1      0         A/5 21171   7.2500  C000        S
1            2         1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1      0          PC 17599  71.2833   C85        C
2            3         1       3                             Heikkinen, Miss. Laina  female  26.0      0      0  STON/O2. 3101282   7.9250  C000        S

In [26]:
titanic_df['Age'] = titanic_df['Age'].fillna(titanic_df['Age'].mean())
titanic_df['Embarked'] = titanic_df['Embarked'].fillna('S')
titanic_df.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

### (9) apply lambda 식으로 데이터 가공

* 함수의 선언과 함수 내의 처리를 한줄의 식으로 쉽게 변환
* lambda 입력인자 : 입력인자가 포함된 계산식

In [ ]:
def get_square(a):
    return a**2

print(get_square(3))

9

In [ ]:
lambda_square = lambda x : x **2
lambda_square(3)

9

* 여러 개의 값을 입력인자로 사용해야 할 경우에는 보통 map()함수를 결합해서 사용

In [ ]:
a=[1,2,3]
squares = map(lambda x : x**2, a)
list(squares)

[1, 4, 9]

In [27]:
# 판다스의 데이터프레임에 적용

titanic_df['Name_len'] = titanic_df['Name'].apply(lambda x: len(x))
titanic_df[['Name', 'Name_len']].head(3)

                                                Name  Name_len
0                            Braund, Mr. Owen Harris        23
1  Cumings, Mrs. John Bradley (Florence Briggs Th...        51
2                             Heikkinen, Miss. Laina        22

In [30]:
titanic_df['Child_Adult'] = titanic_df['Age'].apply(lambda x : 'Child' if x<=15 else 'Adult')
titanic_df[['Age', 'Child_Adult']].head(8)

         Age Child_Adult
0  22.000000       Adult
1  38.000000       Adult
2  26.000000       Adult
3  35.000000       Adult
4  35.000000       Adult
5  29.699118       Adult
6  54.000000       Adult
7   2.000000       Child

In [31]:
titanic_df['Age_cat'] = titanic_df['Age'].apply(lambda x : 'Child' if x<=15 else ('Adult' if x<=60 else 'Elderly'))
titanic_df['Age_cat'].value_counts()

Adult      786
Child       83
Elderly     22
Name: Age_cat, dtype: int64